## common parameter settings
set DUTYCYCLE   0.5;
set OD_RATIO    0.6;
set ID_RATIO    0.6;
set UNCERTAINTY 0.1;
set ITRANSITION 0.5;
set OLOAD       0.2;

set SPI_MAX_OUT 1.3;
set SPI_MIN_OUT -1.3;
set SPI_MAX_IN  1.5;
set SPI_MIN_IN  0.4;
set SDRAM_MAX_OUT 1.3
set SDRAM_MIN_OUT -1.3
set SDRAM_MAX_IN  1.5
set SDRAM_MAX_IN  0.4


## clock specific parameters
set MAINCLK     CLK;
set MAINPERIOD  10;
set MAINWAVE    [list 0.0000 [expr ${MAINPERIOD}*${DUTYCYCLE}]];

set JTAGCLK     CLK_tck_clk
set JTAGPERIOD  60;
set JTAGWAVE    [list 0.0000 [expr ${JTAGPERIOD}*${DUTYCYCLE}]];


# create clocks
create_clock -name ${MAINCLK} -period ${MAINPERIOD} -waveform ${MAINWAVE} [get_ports CLK]

set_input_delay [expr ${ID_RATIO} * ${MAINPERIOD}] -clock [get_clocks ${MAINCLK}] [get_ports boot_mode] 
set_input_delay [expr ${ID_RATIO} * ${MAINPERIOD}] -clock [get_clocks ${MAINCLK}] [get_ports uart0_io_SIN] 
set_input_delay [expr ${ID_RATIO} * ${MAINPERIOD}] -clock [get_clocks ${MAINCLK}] [get_ports uart1_io_SIN] 
set_input_delay [expr ${ID_RATIO} * ${MAINPERIOD}] -clock [get_clocks ${MAINCLK}] [get_ports uart2_io_SIN] 
set_input_delay [expr ${ID_RATIO} * ${MAINPERIOD}] -clock [get_clocks ${MAINCLK}] [get_ports i2c_out_scl_in_in] 
set_input_delay [expr ${ID_RATIO} * ${MAINPERIOD}] -clock [get_clocks ${MAINCLK}] [get_ports i2c_out_sda_in_in] 
set_input_delay [expr ${ID_RATIO} * ${MAINPERIOD}] -clock [get_clocks ${MAINCLK}] [get_ports gpio_io_gpio_in_inp] 
set_input_delay [expr ${ID_RATIO} * ${MAINPERIOD}] -clock [get_clocks ${MAINCLK}] [get_ports ext_interrupts_i] 

set_output_delay [expr ${OD_RATIO} * ${MAINPERIOD}] -clock [get_clocks ${MAINCLK}] [get_ports pwm0_io_pwm_o]
set_output_delay [expr ${OD_RATIO} * ${MAINPERIOD}] -clock [get_clocks ${MAINCLK}] [get_ports pwm1_io_pwm_o]
set_output_delay [expr ${OD_RATIO} * ${MAINPERIOD}] -clock [get_clocks ${MAINCLK}] [get_ports pwm2_io_pwm_o]
set_output_delay [expr ${OD_RATIO} * ${MAINPERIOD}] -clock [get_clocks ${MAINCLK}] [get_ports pwm3_io_pwm_o]
set_output_delay [expr ${OD_RATIO} * ${MAINPERIOD}] -clock [get_clocks ${MAINCLK}] [get_ports pwm4_io_pwm_o]
set_output_delay [expr ${OD_RATIO} * ${MAINPERIOD}] -clock [get_clocks ${MAINCLK}] [get_ports pwm5_io_pwm_o]
set_output_delay [expr ${OD_RATIO} * ${MAINPERIOD}] -clock [get_clocks ${MAINCLK}] [get_ports spi0_io_nss]
set_output_delay [expr ${OD_RATIO} * ${MAINPERIOD}] -clock [get_clocks ${MAINCLK}] [get_ports spi1_io_nss]
set_output_delay [expr ${OD_RATIO} * ${MAINPERIOD}] -clock [get_clocks ${MAINCLK}] [get_ports spi2_io_nss]
set_output_delay [expr ${OD_RATIO} * ${MAINPERIOD}] -clock [get_clocks ${MAINCLK}] [get_ports uart0_io_SOUT]
set_output_delay [expr ${OD_RATIO} * ${MAINPERIOD}] -clock [get_clocks ${MAINCLK}] [get_ports uart1_io_SOUT]
set_output_delay [expr ${OD_RATIO} * ${MAINPERIOD}] -clock [get_clocks ${MAINCLK}] [get_ports uart2_io_SOUT]
set_output_delay [expr ${OD_RATIO} * ${MAINPERIOD}] -clock [get_clocks ${MAINCLK}] [get_ports i2c_out_scl_out]
set_output_delay [expr ${OD_RATIO} * ${MAINPERIOD}] -clock [get_clocks ${MAINCLK}] [get_ports i2c_out_scl_out]
set_output_delay [expr ${OD_RATIO} * ${MAINPERIOD}] -clock [get_clocks ${MAINCLK}] [get_ports i2c_out_sda_out_en]
set_output_delay [expr ${OD_RATIO} * ${MAINPERIOD}] -clock [get_clocks ${MAINCLK}] [get_ports i2c_out_sda_out_en]
set_output_delay [expr ${OD_RATIO} * ${MAINPERIOD}] -clock [get_clocks ${MAINCLK}] [get_ports gpio_io_gpio_out]
set_output_delay [expr ${OD_RATIO} * ${MAINPERIOD}] -clock [get_clocks ${MAINCLK}] [get_ports gpio_io_gpio_out_en]
set_clock_uncertainty [expr ${MAINPERIOD}*${UNCERTAINTY}] ${MAINCLK}

create_clock -name ${JTAGCLK} -period ${JTAGPERIOD} -waveform ${JTAGWAVE} [get_ports CLK_tck_clk]
set_input_delay [expr ${ID_RATIO} * ${JTAGPERIOD}] -clock [get_clocks ${JTAGCLK}] [get_ports tms]
set_input_delay [expr ${ID_RATIO} * ${JTAGPERIOD}] -clock [get_clocks ${JTAGCLK}] [get_ports tdi]
set_input_delay [expr ${ID_RATIO} * ${JTAGPERIOD}] -clock [get_clocks ${JTAGCLK}] [get_ports trst]
set_output_delay [expr ${OD_RATIO} * ${JTAGPERIOD}] -clock [get_clocks ${JTAGCLK}] [get_ports tdo]
set_clock_uncertainty [expr ${JTAGPERIOD}*${UNCERTAINTY}] ${JTAGCLK}

# multicycle paths
set_multicycle_path -setup 4 -from [get_clocks ${JTAGCLK}] -to [get_clocks ${MAINCLK}] -end
set_multicycle_path -hold 3 -from [get_clocks ${JTAGCLK}] -to [get_clocks ${MAINCLK}] -end
set_multicycle_path -setup 4 -from [get_clocks ${MAINCLK}] -to [get_clocks ${JTAGCLK}] -start
set_multicycle_path -hold 4 -from [get_clocks ${MAINCLK}] -to [get_clocks ${JTAGCLK}] -start

# constraints for SPI0
create_generated_clock -name SpiClk0 -edges {0 5 10} -source [get_pins ??] [get_ports spi0_io_sclk]
set_output_delay -clock [get_clocks SpiClk0] -max ${SPI_MAX_OUT} [get_ports spi0_io_mosi]
set_output_delay -clock [get_clocks SpiClk0] -min ${SPI_MIN_OUT} [get_ports spi0_io_mosi]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports spi0_io_mosi] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports spi0_io_mosi] -to [get_clocks ${MAINCLK}]
set_input_delay -clock [get_clocks SpiClk0] -max ${SPI_MAX_IN} [get_ports spi0_io_miso_dat]
set_input_delay -clock [get_clocks SpiClk0] -min ${SPI_MIN_IN} [get_ports spi0_io_miso_dat]
set_multicycle_path -setup -end 2 -from [get_clocks SpiClk0] -through [get_ports spi0_io_miso_dat] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -end 7 -from [get_clocks SpiClk0] -through [get_ports spi0_io_miso_dat] -to [get_clocks ${MAINCLK}]

# constraints for SPI1
create_generated_clock -name SpiClk1 -edges {0 5 10} -source [get_pins ??] [get_ports spi1_io_sclk]
set_output_delay -clock [get_clocks SpiClk1] -max ${SPI_MAX_OUT} [get_ports spi1_io_mosi]
set_output_delay -clock [get_clocks SpiClk1] -min ${SPI_MIN_OUT} [get_ports spi1_io_mosi]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports spi1_io_mosi] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports spi1_io_mosi] -to [get_clocks ${MAINCLK}]
set_input_delay -clock [get_clocks SpiClk1] -max ${SPI_MAX_IN} [get_ports spi1_io_miso_dat]
set_input_delay -clock [get_clocks SpiClk1] -min ${SPI_MIN_IN} [get_ports spi1_io_miso_dat]
set_multicycle_path -setup -end 2 -from [get_clocks SpiClk1] -through [get_ports spi1_io_miso_dat] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -end 7 -from [get_clocks SpiClk1] -through [get_ports spi1_io_miso_dat] -to [get_clocks ${MAINCLK}]

# constraints for SPI2
create_generated_clock -name SpiClk2 -edges {0 5 10} -source [get_pins ??] [get_ports spi2_io_sclk]
set_output_delay -clock [get_clocks SpiClk2] -max ${SPI_MAX_OUT} [get_ports spi2_io_mosi]
set_output_delay -clock [get_clocks SpiClk2] -min ${SPI_MIN_OUT} [get_ports spi2_io_mosi]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports spi2_io_mosi] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports spi2_io_mosi] -to [get_clocks ${MAINCLK}]
set_input_delay -clock [get_clocks SpiClk2] -max ${SPI_MAX_IN} [get_ports spi2_io_miso_dat]
set_input_delay -clock [get_clocks SpiClk2] -min ${SPI_MIN_IN} [get_ports spi2_io_miso_dat]
set_multicycle_path -setup -end 2 -from [get_clocks SpiClk2] -through [get_ports spi2_io_miso_dat] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -end 7 -from [get_clocks SpiClk2] -through [get_ports spi2_io_miso_dat] -to [get_clocks ${MAINCLK}]

# constraints for QSPI
create_generated_clock -name QSpiClk -edges {0 5 10} -source [get_pins ??] [get_ports qspi_io_clk_o]
set_output_delay -clock [get_clocks QSpiClk] -max ${SPI_MAX_OUT} [get_ports qspi_io_io_out[0]]
set_output_delay -clock [get_clocks QSpiClk] -min ${SPI_MIN_OUT} [get_ports qspi_io_io_out[0]]
set_output_delay -clock [get_clocks QSpiClk] -max ${SPI_MAX_OUT} [get_ports qspi_io_io_out[1]]
set_output_delay -clock [get_clocks QSpiClk] -min ${SPI_MIN_OUT} [get_ports qspi_io_io_out[1]]
set_output_delay -clock [get_clocks QSpiClk] -max ${SPI_MAX_OUT} [get_ports qspi_io_io_out[2]]
set_output_delay -clock [get_clocks QSpiClk] -min ${SPI_MIN_OUT} [get_ports qspi_io_io_out[2]]
set_output_delay -clock [get_clocks QSpiClk] -max ${SPI_MAX_OUT} [get_ports qspi_io_io_out[3]]
set_output_delay -clock [get_clocks QSpiClk] -min ${SPI_MIN_OUT} [get_ports qspi_io_io_out[3]]
set_output_delay -clock [get_clocks QSpiClk] -max ${SPI_MAX_OUT} [get_ports qspi_io_io_enable[0]]
set_output_delay -clock [get_clocks QSpiClk] -min ${SPI_MIN_OUT} [get_ports qspi_io_io_enable[0]]
set_output_delay -clock [get_clocks QSpiClk] -max ${SPI_MAX_OUT} [get_ports qspi_io_io_enable[1]]
set_output_delay -clock [get_clocks QSpiClk] -min ${SPI_MIN_OUT} [get_ports qspi_io_io_enable[1]]
set_output_delay -clock [get_clocks QSpiClk] -max ${SPI_MAX_OUT} [get_ports qspi_io_io_enable[2]]
set_output_delay -clock [get_clocks QSpiClk] -min ${SPI_MIN_OUT} [get_ports qspi_io_io_enable[2]]
set_output_delay -clock [get_clocks QSpiClk] -max ${SPI_MAX_OUT} [get_ports qspi_io_io_enable[3]]
set_output_delay -clock [get_clocks QSpiClk] -min ${SPI_MIN_OUT} [get_ports qspi_io_io_enable[3]]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports qspi_io_io_out[0]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports qspi_io_io_out[0]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports qspi_io_io_out[1]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports qspi_io_io_out[1]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports qspi_io_io_out[2]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports qspi_io_io_out[2]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports qspi_io_io_out[3]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports qspi_io_io_out[3]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports qspi_io_io_enable[0]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports qspi_io_io_enable[0]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports qspi_io_io_enable[1]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports qspi_io_io_enable[1]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports qspi_io_io_enable[2]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports qspi_io_io_enable[2]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports qspi_io_io_enable[3]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports qspi_io_io_enable[3]] -to [get_clocks ${MAINCLK}]
set_input_delay -clock [get_clocks QSpiClk] -max ${SPI_MAX_IN} [get_ports qspi_io_io_in_io_in[0]]
set_input_delay -clock [get_clocks QSpiClk] -min ${SPI_MIN_IN} [get_ports qspi_io_io_in_io_in[0]]
set_input_delay -clock [get_clocks QSpiClk] -max ${SPI_MAX_IN} [get_ports qspi_io_io_in_io_in[1]]
set_input_delay -clock [get_clocks QSpiClk] -min ${SPI_MIN_IN} [get_ports qspi_io_io_in_io_in[1]]
set_input_delay -clock [get_clocks QSpiClk] -max ${SPI_MAX_IN} [get_ports qspi_io_io_in_io_in[2]]
set_input_delay -clock [get_clocks QSpiClk] -min ${SPI_MIN_IN} [get_ports qspi_io_io_in_io_in[2]]
set_input_delay -clock [get_clocks QSpiClk] -max ${SPI_MAX_IN} [get_ports qspi_io_io_in_io_in[3]]
set_input_delay -clock [get_clocks QSpiClk] -min ${SPI_MIN_IN} [get_ports qspi_io_io_in_io_in[3]]
set_multicycle_path -setup -end 2 -from [get_clocks QSpiClk] -through [get_ports qspi_io_io_in_io_in[0]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -end 7 -from [get_clocks QSpiClk] -through [get_ports qspi_io_io_in_io_in[0]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -setup -end 2 -from [get_clocks QSpiClk] -through [get_ports qspi_io_io_in_io_in[1]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -end 7 -from [get_clocks QSpiClk] -through [get_ports qspi_io_io_in_io_in[1]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -setup -end 2 -from [get_clocks QSpiClk] -through [get_ports qspi_io_io_in_io_in[2]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -end 7 -from [get_clocks QSpiClk] -through [get_ports qspi_io_io_in_io_in[2]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -setup -end 2 -from [get_clocks QSpiClk] -through [get_ports qspi_io_io_in_io_in[3]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -end 7 -from [get_clocks QSpiClk] -through [get_ports qspi_io_io_in_io_in[3]] -to [get_clocks ${MAINCLK}]

# SDRAM
create_generated_clock -name SDRAMCLK -edges {0 5 10} -source [get_pins CLK] [get_ports CLK_sdram_io_sdram_clk ]
set_output_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_OUT} [get_ports sdram_io_osdr_cke]
set_output_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_OUT} [get_ports sdram_io_osdr_cke]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_cke] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_cke] -to [get_clocks ${MAINCLK}]
set_output_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_OUT} [get_ports sdram_io_osdr_cs_n]
set_output_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_OUT} [get_ports sdram_io_osdr_cs_n]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_cs_n] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_cs_n] -to [get_clocks ${MAINCLK}]
set_output_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_OUT} [get_ports sdram_io_osdr_ras_n]
set_output_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_OUT} [get_ports sdram_io_osdr_ras_n]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_ras_n] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_ras_n] -to [get_clocks ${MAINCLK}]
set_output_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_OUT} [get_ports sdram_io_osdr_cas_n]
set_output_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_OUT} [get_ports sdram_io_osdr_cas_n]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_cas_n] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_cas_n] -to [get_clocks ${MAINCLK}]
set_output_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_OUT} [get_ports sdram_io_osdr_we_n]
set_output_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_OUT} [get_ports sdram_io_osdr_we_n]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_we_n] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_we_n] -to [get_clocks ${MAINCLK}]
set_output_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_OUT} [get_ports sdram_io_osdr_dqm[0]]
set_output_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_OUT} [get_ports sdram_io_osdr_dqm[0]]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_dqm[0]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_dqm[0]] -to [get_clocks ${MAINCLK}]
set_output_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_OUT} [get_ports sdram_io_osdr_dqm[1]]
set_output_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_OUT} [get_ports sdram_io_osdr_dqm[1]]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_dqm[1]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_dqm[1]] -to [get_clocks ${MAINCLK}]
set_output_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_OUT} [get_ports sdram_io_osdr_dqm[2]]
set_output_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_OUT} [get_ports sdram_io_osdr_dqm[2]]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_dqm[2]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_dqm[2]] -to [get_clocks ${MAINCLK}]
set_output_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_OUT} [get_ports sdram_io_osdr_dqm[3]]
set_output_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_OUT} [get_ports sdram_io_osdr_dqm[3]]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_dqm[3]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_dqm[3]] -to [get_clocks ${MAINCLK}]
set_output_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_OUT} [get_ports sdram_io_osdr_ba[0]]
set_output_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_OUT} [get_ports sdram_io_osdr_ba[0]]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_ba[0]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_ba[0]] -to [get_clocks ${MAINCLK}]
set_output_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_OUT} [get_ports sdram_io_osdr_ba[1]]
set_output_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_OUT} [get_ports sdram_io_osdr_ba[1]]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_ba[1]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_ba[1]] -to [get_clocks ${MAINCLK}]
set_output_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_OUT} [get_ports sdram_io_osdr_addr[0]]
set_output_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_OUT} [get_ports sdram_io_osdr_addr[0]]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_addr[0]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_addr[0]] -to [get_clocks ${MAINCLK}]
set_output_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_OUT} [get_ports sdram_io_osdr_addr[1]]
set_output_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_OUT} [get_ports sdram_io_osdr_addr[1]]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_addr[1]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_addr[1]] -to [get_clocks ${MAINCLK}]
set_output_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_OUT} [get_ports sdram_io_osdr_addr[2]]
set_output_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_OUT} [get_ports sdram_io_osdr_addr[2]]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_addr[2]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_addr[2]] -to [get_clocks ${MAINCLK}]
set_output_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_OUT} [get_ports sdram_io_osdr_addr[3]]
set_output_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_OUT} [get_ports sdram_io_osdr_addr[3]]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_addr[3]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_addr[3]] -to [get_clocks ${MAINCLK}]
set_output_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_OUT} [get_ports sdram_io_osdr_addr[4]]
set_output_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_OUT} [get_ports sdram_io_osdr_addr[4]]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_addr[4]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_addr[4]] -to [get_clocks ${MAINCLK}]
set_output_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_OUT} [get_ports sdram_io_osdr_addr[5]]
set_output_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_OUT} [get_ports sdram_io_osdr_addr[5]]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_addr[5]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_addr[5]] -to [get_clocks ${MAINCLK}]
set_output_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_OUT} [get_ports sdram_io_osdr_addr[6]]
set_output_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_OUT} [get_ports sdram_io_osdr_addr[6]]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_addr[6]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_addr[6]] -to [get_clocks ${MAINCLK}]
set_output_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_OUT} [get_ports sdram_io_osdr_addr[7]]
set_output_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_OUT} [get_ports sdram_io_osdr_addr[7]]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_addr[7]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_addr[7]] -to [get_clocks ${MAINCLK}]
set_output_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_OUT} [get_ports sdram_io_osdr_addr[8]]
set_output_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_OUT} [get_ports sdram_io_osdr_addr[8]]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_addr[8]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_addr[8]] -to [get_clocks ${MAINCLK}]
set_output_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_OUT} [get_ports sdram_io_osdr_addr[9]]
set_output_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_OUT} [get_ports sdram_io_osdr_addr[9]]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_addr[9]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_addr[9]] -to [get_clocks ${MAINCLK}]
set_output_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_OUT} [get_ports sdram_io_osdr_addr[10]]
set_output_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_OUT} [get_ports sdram_io_osdr_addr[10]]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_addr[10]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_addr[10]] -to [get_clocks ${MAINCLK}]
set_output_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_OUT} [get_ports sdram_io_osdr_addr[11]]
set_output_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_OUT} [get_ports sdram_io_osdr_addr[11]]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_addr[11]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_addr[11]] -to [get_clocks ${MAINCLK}]
set_output_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_OUT} [get_ports sdram_io_osdr_den_n[0]]
set_output_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_OUT} [get_ports sdram_io_osdr_den_n[0]]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_den_n[0]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_den_n[0]] -to [get_clocks ${MAINCLK}]
set_output_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_OUT} [get_ports sdram_io_osdr_den_n[1]]
set_output_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_OUT} [get_ports sdram_io_osdr_den_n[1]]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_den_n[1]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_den_n[1]] -to [get_clocks ${MAINCLK}]
set_output_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_OUT} [get_ports sdram_io_osdr_den_n[2]]
set_output_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_OUT} [get_ports sdram_io_osdr_den_n[2]]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_den_n[2]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_den_n[2]] -to [get_clocks ${MAINCLK}]
set_output_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_OUT} [get_ports sdram_io_osdr_den_n[3]]
set_output_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_OUT} [get_ports sdram_io_osdr_den_n[3]]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_den_n[3]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_den_n[3]] -to [get_clocks ${MAINCLK}]
set_output_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_OUT} [get_ports sdram_io_osdr_dout[0]]
set_output_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_OUT} [get_ports sdram_io_osdr_dout[0]]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_dout[0]] -to [get_clocks ${MAINCLK}]
aet_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_dout[0]] -to [get_clocks ${MAINCLK}]
set_output_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_OUT} [get_ports sdram_io_osdr_dout[1]]
set_output_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_OUT} [get_ports sdram_io_osdr_dout[1]]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_dout[1]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_dout[1]] -to [get_clocks ${MAINCLK}]
set_output_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_OUT} [get_ports sdram_io_osdr_dout[2]]
set_output_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_OUT} [get_ports sdram_io_osdr_dout[2]]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_dout[2]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_dout[2]] -to [get_clocks ${MAINCLK}]
set_output_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_OUT} [get_ports sdram_io_osdr_dout[3]]
set_output_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_OUT} [get_ports sdram_io_osdr_dout[3]]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_dout[3]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_dout[3]] -to [get_clocks ${MAINCLK}]
set_output_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_OUT} [get_ports sdram_io_osdr_dout[4]]
set_output_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_OUT} [get_ports sdram_io_osdr_dout[4]]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_dout[4]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_dout[4]] -to [get_clocks ${MAINCLK}]
set_output_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_OUT} [get_ports sdram_io_osdr_dout[5]]
set_output_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_OUT} [get_ports sdram_io_osdr_dout[5]]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_dout[5]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_dout[5]] -to [get_clocks ${MAINCLK}]
set_output_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_OUT} [get_ports sdram_io_osdr_dout[6]]
set_output_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_OUT} [get_ports sdram_io_osdr_dout[6]]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_dout[6]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_dout[6]] -to [get_clocks ${MAINCLK}]
set_output_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_OUT} [get_ports sdram_io_osdr_dout[7]]
set_output_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_OUT} [get_ports sdram_io_osdr_dout[7]]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_dout[7]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_dout[7]] -to [get_clocks ${MAINCLK}]
set_output_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_OUT} [get_ports sdram_io_osdr_dout[8]]
set_output_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_OUT} [get_ports sdram_io_osdr_dout[8]]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_dout[8]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_dout[8]] -to [get_clocks ${MAINCLK}]
set_output_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_OUT} [get_ports sdram_io_osdr_dout[9]]
set_output_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_OUT} [get_ports sdram_io_osdr_dout[9]]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_dout[9]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_dout[9]] -to [get_clocks ${MAINCLK}]
set_output_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_OUT} [get_ports sdram_io_osdr_dout[10]]
set_output_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_OUT} [get_ports sdram_io_osdr_dout[10]]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_dout[10]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_dout[10]] -to [get_clocks ${MAINCLK}]
set_output_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_OUT} [get_ports sdram_io_osdr_dout[11]]
set_output_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_OUT} [get_ports sdram_io_osdr_dout[11]]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_dout[11]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_dout[11]] -to [get_clocks ${MAINCLK}]
set_output_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_OUT} [get_ports sdram_io_osdr_dout[12]]
set_output_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_OUT} [get_ports sdram_io_osdr_dout[12]]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_dout[12]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_dout[12]] -to [get_clocks ${MAINCLK}]
set_output_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_OUT} [get_ports sdram_io_osdr_dout[13]]
set_output_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_OUT} [get_ports sdram_io_osdr_dout[13]]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_dout[13]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_dout[13]] -to [get_clocks ${MAINCLK}]
set_output_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_OUT} [get_ports sdram_io_osdr_dout[14]]
set_output_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_OUT} [get_ports sdram_io_osdr_dout[14]]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_dout[14]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_dout[14]] -to [get_clocks ${MAINCLK}]
set_output_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_OUT} [get_ports sdram_io_osdr_dout[15]]
set_output_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_OUT} [get_ports sdram_io_osdr_dout[15]]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_dout[15]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_dout[15]] -to [get_clocks ${MAINCLK}]
set_output_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_OUT} [get_ports sdram_io_osdr_dout[16]]
set_output_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_OUT} [get_ports sdram_io_osdr_dout[16]]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_dout[16]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_dout[16]] -to [get_clocks ${MAINCLK}]
set_output_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_OUT} [get_ports sdram_io_osdr_dout[17]]
set_output_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_OUT} [get_ports sdram_io_osdr_dout[17]]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_dout[17]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_dout[17]] -to [get_clocks ${MAINCLK}]
set_output_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_OUT} [get_ports sdram_io_osdr_dout[18]]
set_output_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_OUT} [get_ports sdram_io_osdr_dout[18]]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_dout[18]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_dout[18]] -to [get_clocks ${MAINCLK}]
set_output_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_OUT} [get_ports sdram_io_osdr_dout[19]]
set_output_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_OUT} [get_ports sdram_io_osdr_dout[19]]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_dout[19]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_dout[19]] -to [get_clocks ${MAINCLK}]
set_output_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_OUT} [get_ports sdram_io_osdr_dout[20]]
set_output_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_OUT} [get_ports sdram_io_osdr_dout[20]]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_dout[20]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_dout[20]] -to [get_clocks ${MAINCLK}]
set_output_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_OUT} [get_ports sdram_io_osdr_dout[21]]
set_output_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_OUT} [get_ports sdram_io_osdr_dout[21]]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_dout[21]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_dout[21]] -to [get_clocks ${MAINCLK}]
set_output_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_OUT} [get_ports sdram_io_osdr_dout[22]]
set_output_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_OUT} [get_ports sdram_io_osdr_dout[22]]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_dout[22]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_dout[22]] -to [get_clocks ${MAINCLK}]
set_output_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_OUT} [get_ports sdram_io_osdr_dout[23]]
set_output_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_OUT} [get_ports sdram_io_osdr_dout[23]]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_dout[23]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_dout[23]] -to [get_clocks ${MAINCLK}]
set_output_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_OUT} [get_ports sdram_io_osdr_dout[24]]
set_output_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_OUT} [get_ports sdram_io_osdr_dout[24]]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_dout[24]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_dout[24]] -to [get_clocks ${MAINCLK}]
set_output_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_OUT} [get_ports sdram_io_osdr_dout[25]]
set_output_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_OUT} [get_ports sdram_io_osdr_dout[25]]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_dout[25]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_dout[25]] -to [get_clocks ${MAINCLK}]
set_output_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_OUT} [get_ports sdram_io_osdr_dout[26]]
set_output_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_OUT} [get_ports sdram_io_osdr_dout[26]]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_dout[26]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_dout[26]] -to [get_clocks ${MAINCLK}]
set_output_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_OUT} [get_ports sdram_io_osdr_dout[27]]
set_output_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_OUT} [get_ports sdram_io_osdr_dout[27]]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_dout[27]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_dout[27]] -to [get_clocks ${MAINCLK}]
set_output_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_OUT} [get_ports sdram_io_osdr_dout[28]]
set_output_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_OUT} [get_ports sdram_io_osdr_dout[28]]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_dout[28]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_dout[28]] -to [get_clocks ${MAINCLK}]
set_output_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_OUT} [get_ports sdram_io_osdr_dout[29]]
set_output_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_OUT} [get_ports sdram_io_osdr_dout[29]]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_dout[29]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_dout[29]] -to [get_clocks ${MAINCLK}]
set_output_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_OUT} [get_ports sdram_io_osdr_dout[30]]
set_output_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_OUT} [get_ports sdram_io_osdr_dout[30]]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_dout[30]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_dout[30]] -to [get_clocks ${MAINCLK}]
set_output_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_OUT} [get_ports sdram_io_osdr_dout[31]]
set_output_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_OUT} [get_ports sdram_io_osdr_dout[31]]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_dout[31]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_dout[31]] -to [get_clocks ${MAINCLK}]
set_output_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_OUT} [get_ports sdram_io_osdr_den_n[0]]
set_output_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_OUT} [get_ports sdram_io_osdr_den_n[0]]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_den_n[0]] -to [get_clocks ${MAINCLK}]
aet_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_den_n[0]] -to [get_clocks ${MAINCLK}]
set_output_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_OUT} [get_ports sdram_io_osdr_den_n[1]]
set_output_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_OUT} [get_ports sdram_io_osdr_den_n[1]]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_den_n[1]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_den_n[1]] -to [get_clocks ${MAINCLK}]
set_output_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_OUT} [get_ports sdram_io_osdr_den_n[2]]
set_output_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_OUT} [get_ports sdram_io_osdr_den_n[2]]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_den_n[2]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_den_n[2]] -to [get_clocks ${MAINCLK}]
set_output_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_OUT} [get_ports sdram_io_osdr_den_n[3]]
set_output_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_OUT} [get_ports sdram_io_osdr_den_n[3]]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_den_n[3]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_den_n[3]] -to [get_clocks ${MAINCLK}]
set_output_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_OUT} [get_ports sdram_io_osdr_den_n[4]]
set_output_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_OUT} [get_ports sdram_io_osdr_den_n[4]]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_den_n[4]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_den_n[4]] -to [get_clocks ${MAINCLK}]
set_output_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_OUT} [get_ports sdram_io_osdr_den_n[5]]
set_output_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_OUT} [get_ports sdram_io_osdr_den_n[5]]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_den_n[5]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_den_n[5]] -to [get_clocks ${MAINCLK}]
set_output_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_OUT} [get_ports sdram_io_osdr_den_n[6]]
set_output_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_OUT} [get_ports sdram_io_osdr_den_n[6]]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_den_n[6]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_den_n[6]] -to [get_clocks ${MAINCLK}]
set_output_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_OUT} [get_ports sdram_io_osdr_den_n[7]]
set_output_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_OUT} [get_ports sdram_io_osdr_den_n[7]]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_den_n[7]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_den_n[7]] -to [get_clocks ${MAINCLK}]
set_output_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_OUT} [get_ports sdram_io_osdr_den_n[8]]
set_output_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_OUT} [get_ports sdram_io_osdr_den_n[8]]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_den_n[8]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_den_n[8]] -to [get_clocks ${MAINCLK}]
set_output_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_OUT} [get_ports sdram_io_osdr_den_n[9]]
set_output_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_OUT} [get_ports sdram_io_osdr_den_n[9]]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_den_n[9]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_den_n[9]] -to [get_clocks ${MAINCLK}]
set_output_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_OUT} [get_ports sdram_io_osdr_den_n[10]]
set_output_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_OUT} [get_ports sdram_io_osdr_den_n[10]]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_den_n[10]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_den_n[10]] -to [get_clocks ${MAINCLK}]
set_output_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_OUT} [get_ports sdram_io_osdr_den_n[11]]
set_output_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_OUT} [get_ports sdram_io_osdr_den_n[11]]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_den_n[11]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_den_n[11]] -to [get_clocks ${MAINCLK}]
set_output_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_OUT} [get_ports sdram_io_osdr_den_n[12]]
set_output_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_OUT} [get_ports sdram_io_osdr_den_n[12]]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_den_n[12]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_den_n[12]] -to [get_clocks ${MAINCLK}]
set_output_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_OUT} [get_ports sdram_io_osdr_den_n[13]]
set_output_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_OUT} [get_ports sdram_io_osdr_den_n[13]]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_den_n[13]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_den_n[13]] -to [get_clocks ${MAINCLK}]
set_output_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_OUT} [get_ports sdram_io_osdr_den_n[14]]
set_output_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_OUT} [get_ports sdram_io_osdr_den_n[14]]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_den_n[14]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_den_n[14]] -to [get_clocks ${MAINCLK}]
set_output_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_OUT} [get_ports sdram_io_osdr_den_n[15]]
set_output_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_OUT} [get_ports sdram_io_osdr_den_n[15]]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_den_n[15]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_den_n[15]] -to [get_clocks ${MAINCLK}]
set_output_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_OUT} [get_ports sdram_io_osdr_den_n[16]]
set_output_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_OUT} [get_ports sdram_io_osdr_den_n[16]]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_den_n[16]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_den_n[16]] -to [get_clocks ${MAINCLK}]
set_output_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_OUT} [get_ports sdram_io_osdr_den_n[17]]
set_output_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_OUT} [get_ports sdram_io_osdr_den_n[17]]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_den_n[17]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_den_n[17]] -to [get_clocks ${MAINCLK}]
set_output_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_OUT} [get_ports sdram_io_osdr_den_n[18]]
set_output_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_OUT} [get_ports sdram_io_osdr_den_n[18]]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_den_n[18]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_den_n[18]] -to [get_clocks ${MAINCLK}]
set_output_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_OUT} [get_ports sdram_io_osdr_den_n[19]]
set_output_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_OUT} [get_ports sdram_io_osdr_den_n[19]]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_den_n[19]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_den_n[19]] -to [get_clocks ${MAINCLK}]
set_output_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_OUT} [get_ports sdram_io_osdr_den_n[20]]
set_output_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_OUT} [get_ports sdram_io_osdr_den_n[20]]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_den_n[20]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_den_n[20]] -to [get_clocks ${MAINCLK}]
set_output_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_OUT} [get_ports sdram_io_osdr_den_n[21]]
set_output_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_OUT} [get_ports sdram_io_osdr_den_n[21]]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_den_n[21]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_den_n[21]] -to [get_clocks ${MAINCLK}]
set_output_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_OUT} [get_ports sdram_io_osdr_den_n[22]]
set_output_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_OUT} [get_ports sdram_io_osdr_den_n[22]]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_den_n[22]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_den_n[22]] -to [get_clocks ${MAINCLK}]
set_output_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_OUT} [get_ports sdram_io_osdr_den_n[23]]
set_output_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_OUT} [get_ports sdram_io_osdr_den_n[23]]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_den_n[23]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_den_n[23]] -to [get_clocks ${MAINCLK}]
set_output_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_OUT} [get_ports sdram_io_osdr_den_n[24]]
set_output_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_OUT} [get_ports sdram_io_osdr_den_n[24]]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_den_n[24]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_den_n[24]] -to [get_clocks ${MAINCLK}]
set_output_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_OUT} [get_ports sdram_io_osdr_den_n[25]]
set_output_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_OUT} [get_ports sdram_io_osdr_den_n[25]]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_den_n[25]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_den_n[25]] -to [get_clocks ${MAINCLK}]
set_output_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_OUT} [get_ports sdram_io_osdr_den_n[26]]
set_output_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_OUT} [get_ports sdram_io_osdr_den_n[26]]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_den_n[26]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_den_n[26]] -to [get_clocks ${MAINCLK}]
set_output_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_OUT} [get_ports sdram_io_osdr_den_n[27]]
set_output_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_OUT} [get_ports sdram_io_osdr_den_n[27]]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_den_n[27]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_den_n[27]] -to [get_clocks ${MAINCLK}]
set_output_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_OUT} [get_ports sdram_io_osdr_den_n[28]]
set_output_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_OUT} [get_ports sdram_io_osdr_den_n[28]]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_den_n[28]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_den_n[28]] -to [get_clocks ${MAINCLK}]
set_output_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_OUT} [get_ports sdram_io_osdr_den_n[29]]
set_output_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_OUT} [get_ports sdram_io_osdr_den_n[29]]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_den_n[29]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_den_n[29]] -to [get_clocks ${MAINCLK}]
set_output_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_OUT} [get_ports sdram_io_osdr_den_n[30]]
set_output_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_OUT} [get_ports sdram_io_osdr_den_n[30]]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_den_n[30]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_den_n[30]] -to [get_clocks ${MAINCLK}]
set_output_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_OUT} [get_ports sdram_io_osdr_den_n[31]]
set_output_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_OUT} [get_ports sdram_io_osdr_den_n[31]]
set_multicycle_path -setup -start 2 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_den_n[31]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -start 7 -from [get_clocks ${MAINCLK}] -through [get_ports sdram_io_osdr_den_n[31]] -to [get_clocks ${MAINCLK}]
set_input_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_IN} [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[0]]
set_input_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_IN} [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[0]]
set_multicycle_path -setup -end 2 -from [get_clocks SDRAMCLK] -through [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[0]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -end 7 -from [get_clocks SDRAMCLK] -through [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[0]] -to [get_clocks ${MAINCLK}]
set_input_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_IN} [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[1]]
set_input_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_IN} [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[1]]
set_multicycle_path -setup -end 2 -from [get_clocks SDRAMCLK] -through [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[1]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -end 7 -from [get_clocks SDRAMCLK] -through [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[1]] -to [get_clocks ${MAINCLK}]
set_input_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_IN} [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[2]]
set_input_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_IN} [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[2]]
set_multicycle_path -setup -end 2 -from [get_clocks SDRAMCLK] -through [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[2]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -end 7 -from [get_clocks SDRAMCLK] -through [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[2]] -to [get_clocks ${MAINCLK}]
set_input_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_IN} [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[3]]
set_input_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_IN} [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[3]]
set_multicycle_path -setup -end 2 -from [get_clocks SDRAMCLK] -through [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[3]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -end 7 -from [get_clocks SDRAMCLK] -through [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[3]] -to [get_clocks ${MAINCLK}]
set_input_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_IN} [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[4]]
set_input_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_IN} [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[4]]
set_multicycle_path -setup -end 2 -from [get_clocks SDRAMCLK] -through [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[4]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -end 7 -from [get_clocks SDRAMCLK] -through [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[4]] -to [get_clocks ${MAINCLK}]
set_input_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_IN} [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[5]]
set_input_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_IN} [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[5]]
set_multicycle_path -setup -end 2 -from [get_clocks SDRAMCLK] -through [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[5]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -end 7 -from [get_clocks SDRAMCLK] -through [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[5]] -to [get_clocks ${MAINCLK}]
set_input_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_IN} [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[6]]
set_input_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_IN} [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[6]]
set_multicycle_path -setup -end 2 -from [get_clocks SDRAMCLK] -through [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[6]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -end 7 -from [get_clocks SDRAMCLK] -through [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[6]] -to [get_clocks ${MAINCLK}]
set_input_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_IN} [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[7]]
set_input_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_IN} [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[7]]
set_multicycle_path -setup -end 2 -from [get_clocks SDRAMCLK] -through [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[7]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -end 7 -from [get_clocks SDRAMCLK] -through [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[7]] -to [get_clocks ${MAINCLK}]
set_input_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_IN} [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[8]]
set_input_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_IN} [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[8]]
set_multicycle_path -setup -end 2 -from [get_clocks SDRAMCLK] -through [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[8]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -end 7 -from [get_clocks SDRAMCLK] -through [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[8]] -to [get_clocks ${MAINCLK}]
set_input_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_IN} [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[9]]
set_input_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_IN} [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[9]]
set_multicycle_path -setup -end 2 -from [get_clocks SDRAMCLK] -through [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[9]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -end 7 -from [get_clocks SDRAMCLK] -through [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[9]] -to [get_clocks ${MAINCLK}]
set_input_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_IN} [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[10]]
set_input_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_IN} [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[10]]
set_multicycle_path -setup -end 2 -from [get_clocks SDRAMCLK] -through [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[10]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -end 7 -from [get_clocks SDRAMCLK] -through [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[10]] -to [get_clocks ${MAINCLK}]
set_input_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_IN} [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[11]]
set_input_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_IN} [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[11]]
set_multicycle_path -setup -end 2 -from [get_clocks SDRAMCLK] -through [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[11]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -end 7 -from [get_clocks SDRAMCLK] -through [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[11]] -to [get_clocks ${MAINCLK}]
set_input_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_IN} [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[12]]
set_input_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_IN} [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[12]]
set_multicycle_path -setup -end 2 -from [get_clocks SDRAMCLK] -through [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[12]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -end 7 -from [get_clocks SDRAMCLK] -through [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[12]] -to [get_clocks ${MAINCLK}]
set_input_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_IN} [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[13]]
set_input_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_IN} [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[13]]
set_multicycle_path -setup -end 2 -from [get_clocks SDRAMCLK] -through [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[13]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -end 7 -from [get_clocks SDRAMCLK] -through [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[13]] -to [get_clocks ${MAINCLK}]
set_input_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_IN} [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[14]]
set_input_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_IN} [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[14]]
set_multicycle_path -setup -end 2 -from [get_clocks SDRAMCLK] -through [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[14]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -end 7 -from [get_clocks SDRAMCLK] -through [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[14]] -to [get_clocks ${MAINCLK}]
set_input_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_IN} [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[15]]
set_input_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_IN} [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[15]]
set_multicycle_path -setup -end 2 -from [get_clocks SDRAMCLK] -through [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[15]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -end 7 -from [get_clocks SDRAMCLK] -through [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[15]] -to [get_clocks ${MAINCLK}]
set_input_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_IN} [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[16]]
set_input_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_IN} [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[16]]
set_multicycle_path -setup -end 2 -from [get_clocks SDRAMCLK] -through [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[16]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -end 7 -from [get_clocks SDRAMCLK] -through [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[16]] -to [get_clocks ${MAINCLK}]
set_input_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_IN} [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[17]]
set_input_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_IN} [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[17]]
set_multicycle_path -setup -end 2 -from [get_clocks SDRAMCLK] -through [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[17]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -end 7 -from [get_clocks SDRAMCLK] -through [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[17]] -to [get_clocks ${MAINCLK}]
set_input_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_IN} [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[18]]
set_input_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_IN} [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[18]]
set_multicycle_path -setup -end 2 -from [get_clocks SDRAMCLK] -through [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[18]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -end 7 -from [get_clocks SDRAMCLK] -through [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[18]] -to [get_clocks ${MAINCLK}]
set_input_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_IN} [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[19]]
set_input_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_IN} [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[19]]
set_multicycle_path -setup -end 2 -from [get_clocks SDRAMCLK] -through [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[19]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -end 7 -from [get_clocks SDRAMCLK] -through [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[19]] -to [get_clocks ${MAINCLK}]
set_input_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_IN} [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[20]]
set_input_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_IN} [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[20]]
set_multicycle_path -setup -end 2 -from [get_clocks SDRAMCLK] -through [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[20]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -end 7 -from [get_clocks SDRAMCLK] -through [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[20]] -to [get_clocks ${MAINCLK}]
set_input_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_IN} [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[21]]
set_input_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_IN} [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[21]]
set_multicycle_path -setup -end 2 -from [get_clocks SDRAMCLK] -through [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[21]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -end 7 -from [get_clocks SDRAMCLK] -through [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[21]] -to [get_clocks ${MAINCLK}]
set_input_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_IN} [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[22]]
set_input_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_IN} [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[22]]
set_multicycle_path -setup -end 2 -from [get_clocks SDRAMCLK] -through [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[22]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -end 7 -from [get_clocks SDRAMCLK] -through [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[22]] -to [get_clocks ${MAINCLK}]
set_input_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_IN} [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[23]]
set_input_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_IN} [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[23]]
set_multicycle_path -setup -end 2 -from [get_clocks SDRAMCLK] -through [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[23]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -end 7 -from [get_clocks SDRAMCLK] -through [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[23]] -to [get_clocks ${MAINCLK}]
set_input_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_IN} [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[24]]
set_input_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_IN} [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[24]]
set_multicycle_path -setup -end 2 -from [get_clocks SDRAMCLK] -through [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[24]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -end 7 -from [get_clocks SDRAMCLK] -through [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[24]] -to [get_clocks ${MAINCLK}]
set_input_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_IN} [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[25]]
set_input_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_IN} [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[25]]
set_multicycle_path -setup -end 2 -from [get_clocks SDRAMCLK] -through [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[25]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -end 7 -from [get_clocks SDRAMCLK] -through [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[25]] -to [get_clocks ${MAINCLK}]
set_input_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_IN} [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[26]]
set_input_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_IN} [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[26]]
set_multicycle_path -setup -end 2 -from [get_clocks SDRAMCLK] -through [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[26]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -end 7 -from [get_clocks SDRAMCLK] -through [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[26]] -to [get_clocks ${MAINCLK}]
set_input_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_IN} [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[27]]
set_input_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_IN} [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[27]]
set_multicycle_path -setup -end 2 -from [get_clocks SDRAMCLK] -through [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[27]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -end 7 -from [get_clocks SDRAMCLK] -through [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[27]] -to [get_clocks ${MAINCLK}]
set_input_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_IN} [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[28]]
set_input_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_IN} [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[28]]
set_multicycle_path -setup -end 2 -from [get_clocks SDRAMCLK] -through [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[28]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -end 7 -from [get_clocks SDRAMCLK] -through [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[28]] -to [get_clocks ${MAINCLK}]
set_input_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_IN} [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[29]]
set_input_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_IN} [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[29]]
set_multicycle_path -setup -end 2 -from [get_clocks SDRAMCLK] -through [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[29]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -end 7 -from [get_clocks SDRAMCLK] -through [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[29]] -to [get_clocks ${MAINCLK}]
set_input_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_IN} [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[30]]
set_input_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_IN} [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[30]]
set_multicycle_path -setup -end 2 -from [get_clocks SDRAMCLK] -through [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[30]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -end 7 -from [get_clocks SDRAMCLK] -through [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[30]] -to [get_clocks ${MAINCLK}]
set_input_delay -clock [get_clocks SDRAMCLK] -max ${SDRAM_MAX_IN} [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[31]]
set_input_delay -clock [get_clocks SDRAMCLK] -min ${SDRAM_MIN_IN} [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[31]]
set_multicycle_path -setup -end 2 -from [get_clocks SDRAMCLK] -through [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[31]] -to [get_clocks ${MAINCLK}]
set_multicycle_path -hold -end 7 -from [get_clocks SDRAMCLK] -through [get_ports sdram_io_ipad_sdr_din_pad_sdr_din[31]] -to [get_clocks ${MAINCLK}]
